//
// Created by malinka on 3/4/24.
//
/*
*Задача 1. З клавіатури вводиться речення: послідовність слів, розділених будь-
якою кількістю пробілів, що закінчується крапкою (крапка не є символом рядка,

це ознака закінчення введення). Все речення не зберігається!! Пам’ять
виділяється лише для одного слово! Відредагувати речення, пропустивши всі
зайві пробіли, залишивши між словами по одному пробілу, слова з непарними
номерами вивести у прямому порядку (за допомогою функції putchar()), слова з
парними номерами записати у зворотному порядку. Вводити речення
посимвольно (за допомогою функції getchar();).
Реалізувати функції:
char removing_spaces (char ch); // пропуск пробілів
char redword(char* word, char ch); // зчитування одного слова
void printword(char* word); // виведення слова в прямому порядку
void printRevword(char*word); // виведення слова в зворотному порядку
Виконати завдання у трьох варіантах, використовуючи передачу параметру типу
char за значенням, за адресою та через глобальну змінну.
 */
#ifndef FUNCTIONS_H
#define FUNCTIONS_H
#define WORDLEN 30
char removing_spaces (char ch); // пропуск пробілів
char readword(char* word, char ch); // зчитування одного слова
void printword(char* word); // виведення слова в прямому порядку
void printRevword(char*word); // виведення слова в зворотному порядку
int findlength(char * word); // знаходження довжини слова
#endif //FUNCTIONS_H
